0.org/alpha.feed.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	volScalarField;
    location	"0";
    object	alpha.feed;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 0 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inletFeed
    {
	type		fixedValue;	//inletOutlet;
//	inletValue	uniform 1;
	value		uniform 1;
    }

    inletGas
    {
	type		fixedValue;	//inletOutlet;
//	inletValue	uniform 0;
	value		uniform 0;
    }

    outlet
    {
	type		zeroGradient;
    }

    leftWall
    {
	type		zeroGradient;
    }

    "nozzle.*"
    {
	type		zeroGradient;
    }

    middlePlane
    {
	type		symmetryPlane;
    }

    defaultFaces
    {
	type		empty;
    }
}

// ************************************************************* //


