0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	volScalarField;
    location 	"0";
    object	epsilon;
}
// * * * * * * * * * * * * * * * * * ** * * * * * * * * * * * * * * //

dimensions [0 2 -3 0 0 0 0];

internalField uniform 0;	//0.00026775;

boundaryField
{
    inletFeed
    {
	type	fixedValue;
	value	uniform 0.00001;	//0.000115641815387;
    }

    inletGas
    {
	type	fixedValue;
	value	uniform 0.00001;	//0.000310274047353;
    }

    outlet
    {
	type	zeroGradient;
    }

    leftWall
    {
	type	epsilonWallFunction;
	value	uniform 0;	//0.00001498;
    }

    "nozzle.*"
    {
	type	epsilonWallFunction;
	value	uniform 0;	//0.00001498;
    }

    middlePlane
    {
	type	symmetryPlane;
    }

    defaultFaces
    {
	type	empty;
    }
}

// **************************************************************** //


