0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{

    version	2.0;
    format	ascii;
    class	volScalarField;
    location	"0";
    object	k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;	//0.00375;

boundaryField
{
    inletFeed
    {
	type	fixedValue;	
	value	uniform 0.00001;	//0.001343860036447;
    }

    inletGas
    {
	type	fixedValue;
	value	uniform 0.00001;	//0.002594823002503;
    }

    outlet
    {
	type	zeroGradient;
    }

    leftWall
    {
	type	kqRWallFunction;	
	value	uniform 0;	//0.002535;
    }

    "nozzle.*"
    {
	type	kqRWallFunction;	
	value	uniform 0.00001;	//0.002535;
    }

    middlePlane
    {
	type	symmetryPlane;
    }

    defaultFaces
    {
	type	empty;
    }
}

// ************************************************************* //



