0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	volScalarField;
    location	"0";
    object	p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 -1 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inletFeed
    {
	type	zeroGradient;
    }

    inletGas
    {
	type	zeroGradient;
    }

    outlet
    {
	type	zeroGradient;
    }

    leftWall
    {
	type	zeroGradient;
    }

    "nozzle.*"
    {
	type	zeroGradient;
    }

    middlePlane
    {
	type	symmetryPlane;
    }

    defaultFaces
    {
	type	empty;
    }
}

// ************************************************************* //


