constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	uniformDimensionedVectorField;
    location	"constant";
    object	g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    dimensions		[0 1 -2 0 0 0 0];
    value		(9.81 0 0);


// ********************************************************************** //

