constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    location	"constant";
    object	transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (feed gas);

feed //2 mole alkoxylate @40 deg C
{
    transportModel 	Newtonian;
    nu			nu [ 0 2 -1 0 0 0 0 ] 2.02E-05;      
    rho			rho [ 1 -3 0 0 0 0 0 ] 839;
//  viscosity: 16.95 cP
//  2 mole acid viscosity @ 40 deg C:   60 cP
//  2 mole acid density @ 40 deg C:     

    CrossPowerLawCoeffs
    {
	nu0		nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
	nuInf		nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
	m		m [ 0 0 1 0 0 0 0 ] 1;
	n		n [ 0 0 0 0 0 0 0 ] 0;
    }
    BirdCarreauCoeffs
    {
	nu0		nu0 [ 0 2 -1 0 0 0 0 ] 0.0142515;
	nuInf		nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
	k		k [ 0 0 1 0 0 0 0 ] 99.6;
	n		n [ 0 0 0 0 0 0 0 ] 0.1003;
    }
}

gas	//3% SO3 in Air @40 deg C
{
    transportModel 	Newtonian;
    nu			nu [ 0 2 -1 0 0 0 0 ] 9.23E-06;
    rho			rho [ 1 -3 0 0 0 0 0 ] 2.22;

    CrossPowerLawCoeffs
    {
	nu0		nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
	nuInf		nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
	m		m [ 0 0 1 0 0 0 0 ] 1;
	n		n [ 0 0 0 0 0 0 0 ] 0;
    }
    BirdCarreauCoeffs
    {
	nu0		nu0 [ 0 2 -1 0 0 0 0 ] 0.0142515;
	nuInf		nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
	k		k [ 0 0 1 0 0 0 0 ] 99.6;
	n		n [ 0 0 0 0 0 0 0 ] 0.1003;
    }
}

    sigma		sigma [1 0 -2 0 0 0 0] 0.030;                   //surface tension of AE-2

// ********************************************************************** //

