system/blockMeshDict.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//
convertToMeters 0.0254;

vertices
(
// back
        (0 0 -0.003937)                //0
        (0.25 0 -0.003937)             //1
        (0.75 0 -0.003937)             //2
        (2.75 0 -0.003937)             //3
        (5.5 0 -0.003937)              //4
        (5.5 0.0225 -0.003937)         //5
        (2.75 0.0225 -0.003937)        //6
        (0.75 0.0225 -0.003937)        //7
        (0.25 0.0225 -0.003937)        //8
        (0 0.0225 -0.003937)           //9
        (5.5 0.0525 -0.003937)         //10
        (2.75 0.0525 -0.003937)        //11
        (0.75 0.0525 -0.003937)        //12
        (5.5 0.125 -0.003937)          //13
        (2.75 0.125 -0.003937)         //14
        (0.75 0.125 -0.003937)         //15
        (0.25 0.125 -0.003937)         //16
        (0 0.125 -0.003937)            //17
        (5.5 0.5 -0.003937)            //18
        (2.75 0.5 -0.003937)           //19
        (0.75 0.5 -0.003937)           //20
        (0.25 0.5 -0.003937)           //21
        (0 0.5 -0.003937)              //22
// front
        (0 0 0.003937)                //23
        (0.25 0 0.003937)             //24
        (0.75 0 0.003937)             //25
        (2.75 0 0.003937)             //26
        (5.5 0 0.003937)              //27
        (5.5 0.0225 0.003937)         //28
        (2.75 0.0225 0.003937)        //29
        (0.75 0.0225 0.003937)        //30
        (0.25 0.0225 0.003937)        //31
        (0 0.0225 0.003937)           //32
        (5.5 0.0525 0.003937)         //33
        (2.75 0.0525 0.003937)        //34
        (0.75 0.0525 0.003937)        //35
        (5.5 0.125 0.003937)          //36
        (2.75 0.125 0.003937)         //37
        (0.75 0.125 0.003937)         //38
        (0.25 0.125 0.003937)         //39
        (0 0.125 0.003937)            //40
        (5.5 0.5 0.003937)            //41
        (2.75 0.5 0.003937)           //42
        (0.75 0.5 0.003937)           //43
        (0.25 0.5 0.003937)           //44
        (0 0.5 0.003937)              //45
);
//
//     6/14------------7/15---------------------------22/23    
//     |      (1)       |             (4)               |       
//     4/12------------5/13---------------------------20/21      
//     |                |             (3)               |
//     3/11------------2/10---------------------------18/19
//     |      (0)       |             (2)               |
//     0/8-------------1/9----------------------------16/17
//
blocks
(
    hex (0 1 8 9 23 24 31 32) (5 9 1) simpleGrading (1 1 1)          //(0)
    hex (1 2 7 8 24 25 30 31) (10 9 1) simpleGrading (1 1 1)         //(1)
    hex (2 3 6 7 25 26 29 30) (40 9 1) simpleGrading (1 1 1)         //(2)
    hex (3 4 5 6 26 27 28 29) (110 9 1) simpleGrading (1 1 1)         //(3)
//
    hex (6 5 10 11 29 28 33 34) (110 12 1) simpleGrading (1 1 1)      //(4)
//
    hex (11 10 13 14 34 33 36 37) (110 29 1) simpleGrading (1 1 1)    //(5)
    hex (12 11 14 15 35 34 37 38) (40 29 1) simpleGrading (1 1 1)    //(6)
    hex (16 12 15 16 39 35 38 39) (10 29 1) simpleGrading (1 1 1)    //(7)

    hex (14 13 18 19 37 36 41 42) (110 50 1) simpleGrading (1 8 1)    //(8)
    hex (15 14 19 20 38 37 42 43) (40 50 1) simpleGrading (1 8 1)    //(9)
    hex (16 15 20 21 39 38 43 44) (10 50 1) simpleGrading (1 8 1)    //(10)
    hex (17 16 21 22 40 39 44 45) (5 50 1) simpleGrading (1 8 1)     //(11)
);

edges
(
);

boundary
(
    inletGas
    {
    	type patch;
   	faces
    (
    	(22 17 40 45)
    );
    }

    inletFeed
    {
    	type patch;
    	faces
    (
	(9 0 23 32)
    );
    }

    outlet
    {
	type patch;
    	faces
    (
	(4 5 28 27)
	(5 10 33 28)
	(10 13 36 33)
        (13 18 41 36)
//        (18 24 54 48)
    );
    }

    leftWall
    {
    	type wall;
    	faces
    (
	(0 1 24 23)
        (1 2 25 24)
        (2 3 26 25)
        (3 4 27 26)
//        (4 5 35 34)
    );
    }

    nozzleWall_Tip
    {
    	type wall;
    	faces
    (
        (6 29 34 11)
    );
    }

    nozzleWall_Feed
    {
    	type wall;
    	faces
    (
	(9 8 31 32)
        (8 7 30 31)
        (7 6 29 30)
//        (8 7 37 38)
    );
    }

    nozzleWall_Gas
    {
    	type wall;
    	faces
    (
        (11 12 35 34)
        (12 16 39 35)
        (16 17 40 39)
//        (22 23 53 52)
    );
    }


    middlePlane
    {
    	type symmetryPlane;
    	faces
    (
        (18 19 42 41)
	(19 20 43 42)
        (20 21 44 43)
        (21 22 45 44)
//        (28 29 59 58)
    );
    }

    );

mergePatchPairs
(
);
//***********************************************************************//


