system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    location	"system";
    object	fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default	Euler;
}

gradSchemes
{
    default	Gauss linear;
}

divSchemes
{
    div(rhoPhi,U) 			Gauss limitedLinearV 1;	//Gauss linear;
    div(phi,alpha) 			Gauss vanLeer;
    div(phirb,alpha) 			Gauss interfaceCompression;
    div(phi,k)				Gauss upwind;
    div(phi,epsilon) 			Gauss upwind;
    div(phi,R)				Gauss upwind;
    div(R)				Gauss linear;
    div(phi,nuTilda) 			Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) 	Gauss linear;
}

laplacianSchemes
{
    default	Gauss linear corrected;
}

interpolationSchemes
{
    default	linear;
}

snGradSchemes
{
    default	corrected;
}

fluxRequired
{
    default	no;
    p_rgh;
    pcorr;
    alpha;
}

// ************************************************************************* //


