system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    location	"system";
    object	fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha.feed
    {
        nAlphaCorr      1;
        nAlphaSubCycles 2;
        cAlpha          1;
    }
    pcorr
    {
	solver		PCG;
	preconditioner	DIC;
	tolerance	1e-10;
	relTol		0;
    }

    pcorrFinal
    {
	solver		PCG;
	preconditioner	DIC;
	tolerance	1e-10;
	relTol		0;
    }
    
    p_rgh
    {
	solver		PCG;
	preconditioner	DIC;
	tolerance	1e-07;
	relTol		0;
    }

    p_rghFinal
    {
	solver		PCG;
	preconditioner	DIC;
	tolerance	1e-07;
	relTol		0;
    }

    "(U|k|epsilon)"
    {
	solver		PBiCG;
	preconditioner	DILU;
	tolerance	1e-06;
	relTol		0;
    }

    "(U|k|epsilon)Final"
    {
	solver		PBiCG;
	preconditioner	DILU;
	tolerance	1e-08;
	relTol		0;
    }
}

PIMPLE
{
    momentumPredictor 		false;
    nCorrectors			3;
    nNonOrthogonalCorrectors 	0;
    pRefCell			0;
    pRefValue			0;
    nAlphaCorr			1;
    nAlphaSubCycles 		4;
    cAlpha			1;
}

relaxationFactors
{
	p_rgh	0.3;
}
// ************************************************************* //

