system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Set output format : choice of
//      xmgr
//      jplot
//      gnuplot
//      raw
//      vtk
//      ensight
//      csv
setFormat raw;

// Surface output format. Choice of
//      null        : suppress output
//      ensight     : Ensight Gold format, one field per case file
//      foamFile    : separate points, faces and values file
//      dx          : DX scalar or vector format
//      vtk         : VTK ascii format
//      raw         : x y z value format for use with e.g. gnuplot 'splot'.
//
// Note:
// other formats such as obj, stl, etc can also be written (by proxy)
// but without any values!
surfaceFormat vtk;

// optionally define extra controls for the output formats
/*formatOptions
{
    ensight
    {
        format  ascii;
    }
}
*/
// interpolationScheme. choice of
//      cell          : use cell-centre value only; constant over cells
//                      (default)
//      cellPoint     : use cell-centre and vertex values
//      cellPointFace : use cell-centre, vertex and face values.
//      pointMVC      : use point values only (Mean Value Coordinates)
//      cellPatchConstrained : like 'cell' but uses cell-centre except on
//                             boundary faces where it uses the boundary value.
//                             For use with e.g. patchCloudSet.
// 1] vertex values determined from neighbouring cell-centre values
// 2] face values determined using the current face interpolation scheme
//    for the field (linear, gamma, etc.)
interpolationScheme cellPoint;

// Fields to sample.
fields
(
    U
    alpha.feed
);

// Set sampling definition: choice of
//      uniform             evenly distributed points on line
//      face                one point per face intersection
//      midPoint            one point per cell, inbetween two face intersections
//      midPointAndFace     combination of face and midPoint
//
//      polyLine            specified points, not nessecary on line, uses
//                          tracking
//      cloud               specified points, uses findCell
//      triSurfaceMeshPointSet  points of triSurface
//
// axis: how to write point coordinate. Choice of
// - x/y/z: x/y/z coordinate only
// - xyz: three columns
//  (probably does not make sense for anything but raw)
// - distance: distance from start of sampling line (if uses line) or
//             distance from first specified sampling point
//
// type specific:
//      uniform, face, midPoint, midPointAndFace : start and end coordinate
//      uniform: extra number of sampling points
//      polyLine, cloud: list of coordinates
//      patchCloud: list of coordinates and set of patches to look for nearest
//      patchSeed: random sampling on set of patches. Points slightly off
//                 face centre.

        y_length 0.0127;                //half of tube diameter

sets
(
    lineX2.50
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (0.0635 0 0);
        end         (0.0635 $y_length 0);
    }
    lineX2.75
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (0.06985 0 0);
        end         (0.06985 $y_length 0);
    }
    lineX3.00
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (0.0762 0 0);
        end         (0.0762 $y_length 0);
    }
    lineX3.25
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with midPoint or edge.
        start       (0.08255 0 0);
        end         (0.08255 $y_length 0);
    }
    lineX3.50
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with midPoint or edge.
        start       (0.0889 0 0);
        end         (0.0889 $y_length 0);
    }
    lineX3.75
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with midPoint or edge.
        start       (0.09525 0 0);
        end         (0.09525 $y_length 0);
    }
    lineX4.00
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with midPoint or edge.
        start       (0.1016 0 0);
        end         (0.1016 $y_length 0);
    }
    lineX4.25
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with midPoint or edge.
        start       (0.10795 0 0);
        end         (0.10795 $y_length 0);
    }
    lineX4.50
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with midPoint or edge.
        start       (0.1143 0 0);
        end         (0.1143 $y_length 0);
    }
    lineX4.75
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with midPoint or edge.
        start       (0.12065 0 0);
        end         (0.12065 $y_length 0);
    }
    lineX5.00
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with midPoint or edge.
        start       (0.127 0 0);
        end         (0.127 $y_length 0);
    }
    lineX5.25
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with midPoint or edge.
        start       (0.13335 0 0);
        end         (0.13335 $y_length 0);
    }
    lineX5.50
    {
        type        midPoint;
        axis        y;

        //- cavity. Slightly perturbed so not to align with midPoint or edge.
        start       (0.1397 0 0);
        end         (0.1397 $y_length 0);
    }
/*
    lineX2
    {
        type        uniform;
        axis        y;

        //- cavity. Slightly perturbed so not to align with face or edge.
        start       (0.100 0.0005715 0);
        end         (0.100 0.0013335 0);
        nPoints     13;
    }
*/
);


// *********************************************************************** //
